<script setup lang="ts">

</script>

<template>
  <div class="bg-[#00B5C0] py-[60px] md:py-[100px] relative px-[20px] md:px-[100px]">
      <img
        src="../assets/img/oyu_1.png"
        alt="Background"
        class="absolute w-[300px] md:w-[600px] top-1/2 -translate-y-1/2 right-1/2 translate-x-1/2"
      />
      
      <div>
        <p
          class="text-[25px] md:text-[60px] font-bold mb-8 pb-8 border-b border-white text-white"
        >
          Біз туралы
        </p>
        <p class="text-[16px] md:text-[24px] text-white">
          <img src="../assets/img/img_1.png" alt="About" class="w-[500px] h-[300px] m-[20px] float-left" />
          Астана қаласы әкімдігінің «Руханият» коммуналдық мемлекеттік мекемесі – елорда аумағында Қазақстан Республикасындағы тіл саясатын іске асыруға бағытталған жұмыстарды үйлестіретін уәкілетті ұйым.
          <br/>✧Мекеме қызметінің мәні мен мақсаты 
            
          <br/>✧	Астана қаласы бойынша Қазақстан Республикасында тіл саясатын дамытудың 2023-2029 жылдарға арналған тұжырымдамасын іске асыру, аталған тұжырымдама бойынша іс шаралар ұйымдастыру.
          <br/>✧	Мемлекеттік тілді меңгеруге қажетті жағдай туғызуға ықпал жасау және оны оқыту курстарын ұйымдастыру, ересектер, оның ішінде азаматтық және мемлекеттік қызметкерлер үшін курстар (қазақ, орыс, ағылшын) ұйымдастыру;
          <br/>✧	Елордадағы мемлекеттік мекемелердің қызметшілеріне және азаматтық қызметшілерге, сондай-ақ халықтың басқа да топтарына үздік әдістемелерді пайдалана отырып, қазақ, орыс, ағылшын тілдерін оқыту, қажетті материалдық-техникалық жағдай жасау, оқулықтар мен оқу-әдістемелік құралдармен қамтамасыз ету;
          <br/>✧	Астана қаласы әкімдігінің жанындағы оқыту орталығының оқытушылары мен қала тұрғындарын оқыту үшін филологтар мен лингвист – ғалымдарды тарта отырып, ұйымдастырылатын республикалық семинарларға, дәрістерге, курстарға қатысу;
          <br/>✧	Қазақ тілін оқыту әдістемесін жетілдіру үшін тәжірибе алмасу мақсатында қазақ тілін оқытушылар мен әдіскерлерге арналған республикалық іс-шараларға қатысу;  
          <br/>✧	Мекеме қызметінің мақсаты «Қазақстан Республикасындағы тіл туралы» Қазақстан Республикасының Заңын іске асыру, сондай-ақ қазақ, орыс, ағылшын тілдерін оқыту процесін оқу-әдістемелік және ғылыми тұрғыдан қамтамасыз ету, оқытудың үздік заманауи әдіс-тәсілдерін зерделеу, оқу-әдістемелік құралдарды әзірлеу. 

          Мекеме мақсатқа жету үшін мынадай қызмет түрлерін жүзеге асырады: 

          <br/>✧	қазақ тілін латын графикасына кезең-кезеңімен көшіру бойынша іс-шаралар өткізу;
          <br/>✧	 оқыту орталықтарының оқытушылары мен ересек тұрғындарды оқыту мақсатында филологтар мен лингвист ғалымдарды тарта отырып, семинарлар мен дәрістер, курстар ұйымдастыру, латын графикасына кезең-кезеңімен көшу бойынша әдістемелік және консультациялық көмек көрсету;
          <br/>✧	 оқу-әдістемелік әдебиеттерді әзірлеу және басып шығару;
          <br/>✧	тақырыптық баспа өнімдерін (жинақтар, буклеттер, брошюралар және оқу-әдістемелік кешендер) жасау; 
          <br/>✧	көрмелер, түрлі форматта конференциялар мен семинарлар, «дөңгелек үстелдер» өткізу;
          <br/>✧	Астана қаласының мемлекеттік қызметшілеріне, мемлекеттік емес мекемелері мен кәсіпорындарының қызметкерлеріне арналған тілдік курстар ұйымдастыру;
          <br/>✧	мемлекеттік және басқа тілдерді, латын графикасын үйрену мақсатында бағдарламалар жасау және оны іске асыру;
          <br/>✧	тіл саясатын іске асыруға қатысты мәселелер бойынша мемлекеттік және мемлекеттік емес органдармен, шығармашылық одақтармен, бірлестіктермен өзара әрекет жасасу;
          <br/>✧	тілдер фестивалін және ұлттық әдет-ғұрып конкурстарын ұйымдастыру және өткізу;
          <br/>✧	Бейне контент өндіру және оны одан әрі әлеуметтік желілер мен медиа платформаларда орналастыру;
          <br/>✧	Қазақстан Республикасының мемлекеттік рәміздерін дәріптеу бойынша ақпараттық-насихаттау жұмыстарын жүргізу;
          <br/>✧	Астана қаласының көшелері мен маңызы бар объектілері туралы ақпараттық, фото және бейнематериалдар жасау жұмыстарына, елорда көшелерінің атауларын ретке келтірудің негізгі бағыттарын айқындау жөніндегі жұмыстарды ұйымдастыруға, ономастиканың өзекті мәселелері бойынша әдебиеттерді әзірлеу және басып шығару жұмыстарына қатысу; 
          <br/>✧	патриоттық бағыттағы іс-шараларды, шығармашылық мерейтойлық кештер мен зиялы қауымды еске алу кештерін өткізу.
          «Руханият» мекемесі – тілді, руханиятты және ұлттық болмысты дамытуға арналған сан қырлы бастамалар мен жобалардың ордасы. Біз мемлекеттік тілдің қолданысын кеңейтіп қана қоймай, елордалық қоғамның мәдени-рухани әлеуетін арттыруға бағытталған ауқымды жұмыстарды жүзеге асырып келеміз.
          
        </p>
      </div>
        
      
    </div>
</template>
