import { createI18n } from 'vue-i18n'

const messages = {
  kk: {
    search_placeholder: 'Сайт бойынша іздеу',
    quote_missing: 'Бүгінге арналған дәйексөз табылмады.',
    menu: {
      news: 'Жаңалықтар',
      projects: 'Жобалар',
      structure: 'Құрылым',
      contact: 'Байланыс',
      courses: 'Тіл курстары',
      course1: 'Мемлекеттік тілде өткізілген сабақтардың сағат саны',
      course2: 'Мемлекеттік тіл курсына қатысушылар тізімі',
      course3: 'Мемлекеттік тіл курсының сабақ кестесі',
      course4: 'Сабаққа қатысу туралы мәлімет',
      course5: 'Ағылшын тілі курстары',
      about: 'Жалпы Ақпарат',
      departments: 'Бөлімдер'
    },
    main: {
        news: 'Жаңалықтар',
        about: 'Біз туралы',
        text: 'Астана қаласы әкімдігінің «Руханият» КММ – елордада тіл саясатын іске асыруға жауапты мекеме..Мекеме қызметінің негізгі бағыттары:.2023–2029 жылдарға арналған тіл саясатын жүзеге ас.Қазақ, орыс, ағылшын тілдерін ересектерге, мемлекеттік және азаматтық қызметкерлерге оқ.Оқытушыларды оқыту және тәжірибе алмасу семинарларын ұйымдаст.Латын графикасына көшу бойынша іс-шаралар мен әдістемелік қолдау көрс.Оқу-әдістемелік құралдар дайындау және тар.Көрмелер, конференциялар, дөңгелек үстелдер өтк .Тілдік курстар мен бағдарламалар ұйымдаст.Мемлекеттік және мемлекеттік емес ұйымдармен ынтымақтастық орн.Тілдер фестивалі мен ұлттық байқаулар өтк.Бейнематериалдар жасап, әлеуметтік желілерде тар.Мемлекеттік рәміздерді дәріптеу, ономастика және патриоттық іс-шараларға қаты.Мақсаты: Мемлекеттік тілді және көптілділікті дамыту, ұлттық рухани құндылықтарды насихаттау.'
        ,book:'Кітаптар',
        projects : 'Жобалар',
        partners : 'Серіктестер',
        all: 'Барлығы',
        text1:'Біздің жаңалықтар таратылымымызға жазылыңыз.',
        text2:'Біз сізге соңғы айда жіберілген қысқа мәліметтерді, жаңартуларды және команда талғау туралы ақпараттарды жеткіземіз.',
        placeHolder: '@ Сіздің поштаңыз',
        btn:'Жазылу'
    },
    about: {
        text : ' Астана қаласы әкімдігінің «Руханият» коммуналдық мемлекеттік мекемесі – елорда аумағында Қазақстан Республикасындағы тіл саясатын іске асыруға бағытталған жұмыстарды үйлестіретін уәкілетті ұйым.✧Мекеме қызметінің мәні мен мақсаты   ✧	Астана қаласы бойынша Қазақстан Республикасында тіл саясатын дамытудың 2023-2029 жылдарға арналған тұжырымдамасын іске асыру, аталған тұжырымдама бойынша іс шаралар ұйымдастыру.✧	Мемлекеттік тілді меңгеруге қажетті жағдай туғызуға ықпал жасау және оны оқыту курстарын ұйымдастыру, ересектер, оның ішінде азаматтық және мемлекеттік қызметкерлер үшін курстар (қазақ, орыс, ағылшын) ұйымдастыру;✧	Елордадағы мемлекеттік мекемелердің қызметшілеріне және азаматтық қызметшілерге, сондай-ақ халықтың басқа да топтарына үздік әдістемелерді пайдалана отырып, қазақ, орыс, ағылшын тілдерін оқыту, қажетті материалдық-техникалық жағдай жасау, оқулықтар мен оқу-әдістемелік құралдармен қамтамасыз ету;✧	Астана қаласы әкімдігінің жанындағы оқыту орталығының оқытушылары мен қала тұрғындарын оқыту үшін филологтар мен лингвист – ғалымдарды тарта отырып, ұйымдастырылатын республикалық семинарларға, дәрістерге, курстарға қатысу;✧	Қазақ тілін оқыту әдістемесін жетілдіру үшін тәжірибе алмасу мақсатында қазақ тілін оқытушылар мен әдіскерлерге арналған республикалық іс-шараларға қатысу;  ✧	Мекеме қызметінің мақсаты «Қазақстан Республикасындағы тіл туралы» Қазақстан Республикасының Заңын іске асыру, сондай-ақ қазақ, орыс, ағылшын тілдерін оқыту процесін оқу-әдістемелік және ғылыми тұрғыдан қамтамасыз ету, оқытудың үздік заманауи әдіс-тәсілдерін зерделеу, оқу-әдістемелік құралдарды әзірлеу.Мекеме мақсатқа жету үшін мынадай қызмет түрлерін жүзеге асырад✧	қазақ тілін латын графикасына кезең-кезеңімен көшіру бойынша іс-шаралар өткізу;✧	 оқыту орталықтарының оқытушылары мен ересек тұрғындарды оқыту мақсатында филологтар мен лингвист ғалымдарды тарта отырып, семинарлар мен дәрістер, курстар ұйымдастыру, латын графикасына кезең-кезеңімен көшу бойынша әдістемелік және консультациялық көмек көрсету;✧	 оқу-әдістемелік әдебиеттерді әзірлеу және басып шығару;✧	тақырыптық баспа өнімдерін (жинақтар, буклеттер, брошюралар және оқу-әдістемелік кешендер) жасау; ✧	көрмелер, түрлі форматта конференциялар мен семинарлар, «дөңгелек үстелдер» өткізу;✧	Астана қаласының мемлекеттік қызметшілеріне, мемлекеттік емес мекемелері мен кәсіпорындарының қызметкерлеріне арналған тілдік курстар ұйымдастыру;✧	мемлекеттік және басқа тілдерді, латын графикасын үйрену мақсатында бағдарламалар жасау және оны іске асыру;✧	тіл саясатын іске асыруға қатысты мәселелер бойынша мемлекеттік және мемлекеттік емес органдармен, шығармашылық одақтармен, бірлестіктермен өзара әрекет жасасу;✧	тілдер фестивалін және ұлттық әдет-ғұрып конкурстарын ұйымдастыру және өткізу;✧	Бейне контент өндіру және оны одан әрі әлеуметтік желілер мен медиа платформаларда орналастыру;✧	Қазақстан Республикасының мемлекеттік рәміздерін дәріптеу бойынша ақпараттық-насихаттау жұмыстарын жүргізу;✧	Астана қаласының көшелері мен маңызы бар объектілері туралы ақпараттық, фото және бейнематериалдар жасау жұмыстарына, елорда көшелерінің атауларын ретке келтірудің негізгі бағыттарын айқындау жөніндегі жұмыстарды ұйымдастыруға, ономастиканың өзекті мәселелері бойынша әдебиеттерді әзірлеу және басып шығару жұмыстарына қатысу; ✧	патриоттық бағыттағы іс-шараларды, шығармашылық мерейтойлық кештер мен зиялы қауымды еске алу кештерін өткізу.«Руханият» мекемесі – тілді, руханиятты және ұлттық болмысты дамытуға арналған сан қырлы бастамалар мен жобалардың ордасы. Біз мемлекеттік тілдің қолданысын кеңейтіп қана қоймай, елордалық қоғамның мәдени-рухани әлеуетін арттыруға бағытталған ауқымды жұмыстарды жүзеге асырып келеміз.'
    },
    map: {
        contact:'Бізбен байланыс',
        adress:'Мекен жай:',
    }
  },
  ru: {
    search_placeholder: 'Поиск по сайту',
    quote_missing: 'Цитата на сегодня не найдена.',
    menu: {
      news: 'Новости',
      projects: 'Проекты',
      structure: 'Структура',
      contact: 'Контакты',
      courses: 'Языковые курсы',
      course1: 'Количество часов занятий на государственном языке',
      course2: 'Список участников курса',
      course3: 'Расписание курсов',
      course4: 'Информация о посещаемости занятий',
      course5: 'Курсы английского языка',
      about: 'Общая информация',
      departments: 'Отделы',
      
    },
    main: {
        news: 'Новости',
        about: 'О Нас',
        text:'Акимат города Астаны «Руханият» КГУ — уполномоченное учреждение, ответственное за реализацию языковой политики в столице.Основные направления деятельности учреждения:Реализация языковой политики на 2023–2029 годы.Обучение казахскому, русскому и английскому языкам взрослых, государственных и гражданских служащих.Организация семинаров по обучению преподавателей и обмену опытом.Проведение мероприятий и методическая поддержка по переходу на латинскую графику.Подготовка и распространение учебно-методических пособий.Проведение выставок, конференций и круглых столов.Организация языковых курсов и программ.Установление сотрудничества с государственными и негосударственными организациями.Проведение фестиваля языков и национальных конкурсов.Создание видеоматериалов и распространение в социальных сетяхПопуляризация государственных символов, участие в ономастической и патриотической деятельности.Цель: развитие государственного языка и многоязычия, продвижение национальных духовных ценностей.'
        ,book:'Книги',
        projects : 'Проекты',
        partners : 'Партнеры',
        all: 'Все',
        text1:'Подпишитесь на нашу новостную рассылку.',
        text2:'Мы будем отправлять вам краткие сводки, обновления и информацию о наборе в команду, отправленные за последний месяц.',
        placeHolder: '@ Ваша почта',
        btn:'Подписаться'
    },
    about: {
        text : ' Коммунальное государственное учреждение «Руханият» акимата города Астаны — уполномоченная организация, координирующая деятельность по реализации языковой политики Республики Казахстан на территории столицы.Предмет и цели деятельности Учреждения✧Реализация концепции развития языковой политики в Республике Казахстан по городу Астане на 2023-2029 годы, организация мероприятий по данной концепции.✧Содействие созданию необходимых условий для овладения государственным языком и организация курсов его обучения, организация курсов (казахский, русский, английский) для взрослых, в том числе гражданских и государственных служащих;✧Обучение служащим государственных учреждений и гражданским служащим столицы, а также другим группам населения казахскому, русскому, английскому языкам с использованием лучших методик, создание необходимых материально-технических условий, обеспечение учебниками и учебно-методическими пособиями;✧Участие в республиканских семинарах, лекциях, курсах, организуемых с привлечением филологов и ученых – лингвистов для обучения преподавателей учебного центра при акимате города Астаны и жителей города;✧Участие в республиканских мероприятиях для преподавателей и методистов казахского языка с целью обмена опытом для совершенствования методики преподавания казахского языка;✧Целью деятельности Учреждения является реализация Закона Республики Казахстан «О языках в Республике Казахстан», а также учебно-методическое и научное обеспечение процесса обучения казахскому, русскому, английскому языкам, изучение лучших современных методов и приемов обучения, разработка учебно-методических пособий.Для достижения цели Учреждение осуществляет следующие виды деятельности: ✧проведение мероприятий по поэтапному переходу казахского языка на латинскую графику;✧организация семинаров и лекций, курсов с привлечением филологов и лингвистов для обучения преподавателей обучающих центров и взрослого населения, оказание методической и консультационной помощи по поэтапному переходу на латинскую графику;✧разработка и издание учебно-методической литературы;✧создание тематической печатной продукции (сборники, буклеты, брошюры и учебно-методические пособия);✧проведение выставок, конференций и семинаров, «круглых столов» в различных форматах;✧организация языковых курсов для государственных служащих, работников негосударственных учреждений и предприятий города Астаны;✧создание и реализация программ для изучения государственного и других языков, латинской графики;✧взаимодействие с государственными и негосударственными органами, творческими союзами, объединениями по вопросам, касающимся реализации языковой политики;✧организация и проведение фестивалей языков и конкурсов национальных обычаев;✧производства видеоконтента с дальнейшим размещением в социальных сетях и на медиа платформах;✧проведение информационно-пропагандистских работ по популяризации государственных символов Республики Казахстан;✧	участие в работе по созданию информационных, фото-и видеоматериалов об улицах и значимых объектах города Астаны, в организации работы по определению основных направлений упорядочения названий улиц столицы, в разработке и издании литературы по актуальным вопросам ономастики;✧проведение мероприятий патриотического направления, творческих юбилейных вечеров и вечеров памяти людей творческой интеллигенции.«Руханият» – это площадка для развития языка, духовности и национальной идентичности. Мы не только расширяем сферу применения государственного языка, но и реализуем масштабные культурно-просветительские инициативы, направленные на укрепление духовного потенциала столичного сообщества.'
    },
    map: {
        contact:'Свяжитесь с нами',
        adress:'Адрес:',
    }
    
  }
}

const i18n = createI18n({
  legacy: false,
  locale: 'kk',
  fallbackLocale: 'ru',
  messages
})

export default i18n
